In [ ]:
b = open('class230pm.txt',"r")
print(b.readline())
e = b.read()

print(e)
n = int(input("Enter the line no.: "))
for i in range(1,8):
    if i != n:
        print(b.readline())
    else:
        global z  
        z = b.readline()
        print(z)
        y = e.replace(z,'')
b.close()

a = open('class230pm.txt',"w")
a.write(y)
a.close()

In [1]:
b = open('class230pm.txt',"r")
e = b.read()
file_data = e.split('\n')
print(file_data)
b.close()

['1. Apple', '2. Ball', '3. Cat', '4. Dog', '5. Egg', '6. Fish', '7. Gold']

In [9]:
b = open('class230pm.txt',"r")
e = b.read()
file_data = e.split('\n')
del file_data[2]
print(file_data)
b.close()

b = open('class230pm1.txt',"a")
for i in file_data:
    b.write(f'{i}\n')
b.close()

['1. Apple', '2. Ball', '4. Dog', '5. Egg', '6. Fish', '7. Gold']

In [10]:
# deleting file
import os
os.remove('data.csv')

In [13]:
import os
if os.path.exists('data.csv'):
    os.remove('data.csv')
else:
    print("There is no such file.")

There is no such file.

In [14]:
# copying file
import shutil
src = 'data.txt'
dst = 'Untitled Folder'
shutil.copy(src,dst)

'Untitled Folder\\data.txt'

In [15]:
# copying directories
import shutil
src = 'Untitled Folder'
dst = 'Untitled Folder 2'
shutil.copytree(src,dst)  # file must not be copy in existed file.

'Untitled Folder 2'

In [ ]:
# moving files and directories
import shutil
shutil.move('dir_1','backup/')

In [16]:
# creating the csv file
s=""
n = int(input("Enter how many rows = "))
for i in range(n):
    name = input("Enter the name: ")
    phone = int(input("Enter the phone no.: "))
    age = int(input("Enter the age: "))
    add = input("Enter the address: ")
    blood = input("Enter the blood group: ")
    info = f"{name},{age},{add},{phone},{blood}\n"
    s = s+info
    
b = open("info.csv",'w')
b.write(s)
b.close()

Enter how many rows = 6
Enter the name: Ram
Enter the phone no.: 9856235689
Enter the age: 25
Enter the address: Kathmandu
Enter the blood group: A+
Enter the name: Shyam
Enter the phone no.: 9856124578
Enter the age: 32
Enter the address: Kathmandu
Enter the blood group: B+
Enter the name: Gita
Enter the phone no.: 9845785623
Enter the age: 20
Enter the address: Bara
Enter the blood group: B+
Enter the name: Nabina
Enter the phone no.: 9812234548
Enter the age: 45
Enter the address: Bhaktapur
Enter the blood group: O-
Enter the name: Tara
Enter the phone no.: 9823127898
Enter the age: 65
Enter the address: Pyuthan
Enter the blood group: AB+
Enter the name: Uttam
Enter the phone no.: 9845657823
Enter the age: 18
Enter the address: Bhaktapur
Enter the blood group: AB-

In [18]:
import pandas as pd
df = pd.read_csv('info.csv')
df 
# csv file take first row as column

      Ram  25  Kathmandu  9856235689   A+
0   Shyam  32  Kathmandu  9856124578   B+
1    Gita  20       Bara  9845785623   B+
2  Nabina  45  Bhaktapur  9812234548   O-
3    Tara  65    Pyuthan  9823127898  AB+
4   Uttam  18  Bhaktapur  9845657823  AB-

In [20]:
import pandas as pd
df = pd.read_csv('info.csv')
df

     Name  Age    Address       Phone Blood
0     Ram   25  Kathmandu  9856235689    A+
1   Shyam   32  Kathmandu  9856124578    B+
2    Gita   20       Bara  9845785623    B+
3  Nabina   45  Bhaktapur  9812234548    O-
4    Tara   65    Pyuthan  9823127898   AB+
5   Uttam   18  Bhaktapur  9845657823   AB-

In [21]:
import pandas as pd
df = pd.read_csv('info.csv',nrows = 4)  # print 4 rows datas
df

     Name  Age    Address       Phone Blood
0     Ram   25  Kathmandu  9856235689    A+
1   Shyam   32  Kathmandu  9856124578    B+
2    Gita   20       Bara  9845785623    B+
3  Nabina   45  Bhaktapur  9812234548    O-

In [22]:
import pandas as pd
df = pd.read_csv('info.csv',index_col = 'Name')
df

        Age    Address       Phone Blood
Name
Ram      25  Kathmandu  9856235689    A+
Shyam    32  Kathmandu  9856124578    B+
Gita     20       Bara  9845785623    B+
Nabina   45  Bhaktapur  9812234548    O-
Tara     65    Pyuthan  9823127898   AB+
Uttam    18  Bhaktapur  9845657823   AB-

In [23]:
import pandas as pd
df = pd.read_csv('info.csv',index_col = 'Name')
df.head(4)

        Age    Address       Phone Blood
Name
Ram      25  Kathmandu  9856235689    A+
Shyam    32  Kathmandu  9856124578    B+
Gita     20       Bara  9845785623    B+
Nabina   45  Bhaktapur  9812234548    O-

In [26]:
import pandas as pd
df = pd.read_csv('info.csv',index_col = 1)
# df.head(4)
df.tail(4)   #read table data from bottom

       Name    Address       Phone Blood
Age
20     Gita       Bara  9845785623    B+
45   Nabina  Bhaktapur  9812234548    O-
65     Tara    Pyuthan  9823127898   AB+
18    Uttam  Bhaktapur  9845657823   AB-

In [30]:
import pandas as pd
df = pd.read_csv('info.csv',index_col = "Name",usecols = ['Name','Address'])
df.head()

          Address
Name
Ram     Kathmandu
Shyam   Kathmandu
Gita         Bara
Nabina  Bhaktapur
Tara      Pyuthan